app/controllers/sessions_controller.rb

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."Usuario_correo" = $1 LIMIT 1  [["Usuario_correo", "francisco.avello@usach.cl"]]
---
	def create
		auth = request.env["omniauth.auth"]
		session[:omniauth] = auth.except('extra')
		user = User.sign_in_from_omniauth(auth)
		session[:user_id] = user.id
		usuarioSemilogeado = Usuario.find_by(Usuario_correo: auth[:info][:email])