app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("Usuario_rut", "Usuario_nombre", "Usuario_correo", "Usuario_rol", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"